Revit 2027 API
ParameterTypeId.SpaceCarpetingParam Property
 "Carpeting"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpaceCarpetingParam { get; }
Public Shared ReadOnly Property SpaceCarpetingParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpaceCarpetingParam {
	ForgeTypeId^ get ();
}
static member SpaceCarpetingParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace